# Exploring DataFrames: Columns, Rows, and Indexing

## In this tutorial, we will learn how to:
#### - Create a DataFrame
#### - Access columns and rows
#### - Perform basic indexing
## Let's get started!

### 1. Importing Pandas
#### First, let's import the Pandas library.

In [9]:
import pandas as pd

### 2. Creating a DataFrame
#### We will create a DataFrame using a dictionary.

In [18]:
# Sample data: A dictionary of lists
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eva"],
    "Age": [25, 30, 35, 40, 28],
    "City": ["New York", "Los Angeles", "Chicago", "Houston", "Phoenix"],
    "Score": [85, 90, 88, 76, 95]
}

# Convert the dictionary to a DataFrame
df = pd.DataFrame(data)

# Display the DataFrame
print("Our DataFrame:")
df

Our DataFrame:

      Name  Age         City  Score
0    Alice   25     New York     85
1      Bob   30  Los Angeles     90
2  Charlie   35      Chicago     88
3    David   40      Houston     76
4      Eva   28      Phoenix     95

### 3. Exploring Columns
#### Columns in a DataFrame represent features or attributes.

In [19]:
# Access a single column
print("Column 'Name':")
df["Name"]

Column 'Name':

0      Alice
1        Bob
2    Charlie
3      David
4        Eva
Name: Name, dtype: object

In [20]:
# Access multiple columns
print("Columns 'Name' and 'Age':")
df[["Name", "Age"]]

Columns 'Name' and 'Age':

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40
4      Eva   28

### 4. Exploring Rows
#### Rows represent individual records or observations.

In [17]:
df

      Name  Age         City  Score
0    Alice   25     New York     85
1      Bob   30  Los Angeles     90
2  Charlie   35      Chicago     88
3    David   40      Houston     76
4      Eva   28      Phoenix     95

In [21]:
# Access a single row by index using `.iloc`
print("Row at index 2 (Charlie):")
df.iloc[2]

Row at index 2 (Charlie):

Name     Charlie
Age           35
City     Chicago
Score         88
Name: 2, dtype: object

In [22]:
# Access multiple rows by index
print("Rows at index 1 and 3:")
df.iloc[[1, 3]]

Rows at index 1 and 3:

    Name  Age         City  Score
1    Bob   30  Los Angeles     90
3  David   40      Houston     76

### 5. Indexing and Filtering
#### We can filter rows based on conditions.

In [23]:
# Example: Get all rows where Age > 30
print("Rows where Age > 30:")
df[df["Age"] > 30]

Rows where Age > 30:

      Name  Age     City  Score
2  Charlie   35  Chicago     88
3    David   40  Houston     76

In [24]:
# Example: Get all rows where Score >= 90
print("Rows where Score >= 90:")
df[df["Score"] >= 90]

Rows where Score >= 90:

  Name  Age         City  Score
1  Bob   30  Los Angeles     90
4  Eva   28      Phoenix     95

In [30]:
# Example : Rows where Age > 30 AND Score > 85
print("\nRows where Age > 30 AND Score > 85:")
df[(df["Age"] > 30) & (df["Score"] > 85)]

Rows where Age > 30 AND Score > 85:

      Name  Age     City  Score
2  Charlie   35  Chicago     88

In [31]:
# Example : Rows where City is 'New York' OR Score > 90
print("\nRows where City is 'New York' OR Score > 90:")
df[(df["City"] == "New York") | (df["Score"] > 90)]

Rows where City is 'New York' OR Score > 90:

    Name  Age      City  Score
0  Alice   25  New York     85
4    Eva   28   Phoenix     95

### 6. Accessing Data by Labels
#### Instead of numeric indices, we can use labels with `.loc`.

In [26]:
# Access a specific row by label
df.set_index("Name", inplace=True)  # Set 'Name' as the index
print("\nDataFrame with 'Name' as index:")
df

DataFrame with 'Name' as index:

         Age         City  Score
Name
Alice     25     New York     85
Bob       30  Los Angeles     90
Charlie   35      Chicago     88
David     40      Houston     76
Eva       28      Phoenix     95

In [28]:
# Access row using a label
print("\nDetails for 'Bob':")
df.loc["Bob"]

Details for 'Bob':

Age               30
City     Los Angeles
Score             90
Name: Bob, dtype: object

In [29]:
# Reset the index
df.reset_index(inplace=True)
df

      Name  Age         City  Score
0    Alice   25     New York     85
1      Bob   30  Los Angeles     90
2  Charlie   35      Chicago     88
3    David   40      Houston     76
4      Eva   28      Phoenix     95